# SpatialElementTag Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementTag Class
Members See Also
---
A tag attached to a SpatialElement (room, space or area) in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class SpatialElementTag : Element
```

Visual Basic
---
```text
Public Class SpatialElementTag _
	Inherits Element
```

Visual C++
---
```text
public ref class SpatialElementTag : public Element
```

# Remarks
SpatialElementTag is the base class for RoomTag, SpaceTag and AreaTag. Zone tag is not derived from SpatialElementTag. See IndependentTag for more information.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..SpatialElementTag Autodesk.Revit.DB.Architecture..::..RoomTag Autodesk.Revit.DB..::..AreaTag Autodesk.Revit.DB.Mechanical..::..SpaceTag
# See Also
SpatialElementTag Members
Autodesk.Revit.DB Namespace